Revit 2024 API
BuiltInFailures.DimensionFailures.DimensionUnlocked Property
 Dimension had to be un-EQed in order to remove sketch over-constraining.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DimensionUnlocked { get; }
Visual Basic
Public Shared ReadOnly Property DimensionUnlocked As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DimensionUnlocked {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace